# IFC_DefPsetBegin

## Description
Marks the beginning of creation of a new Custom Object Preset.

```pascal
FUNCTION IFC_DefPsetBegin(psetName : STRING) : BOOLEAN;
```

```python

def vs.IFC_DefPsetBegin(psetName):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|psetName|STRING||

## Version
Availability: from Vectorworks 2016
## Category
* IFC